Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/afec.h
#define AFEC_SEQ2R_USCH8_Pos                0                                              /**< (AFEC_SEQ2R) User Sequence Number 8 Position */
#define AFEC_SEQ2R_USCH8_Msk                (_U_(0xF) << AFEC_SEQ2R_USCH8_Pos)             /**< (AFEC_SEQ2R) User Sequence Number 8 Mask */
#define AFEC_SEQ2R_USCH8(value)             (AFEC_SEQ2R_USCH8_Msk & ((value) << AFEC_SEQ2R_USCH8_Pos))
#define AFEC_SEQ2R_USCH9_Pos                4                                              /**< (AFEC_SEQ2R) User Sequence Number 9 Position */
#define AFEC_SEQ2R_USCH9_Msk                (_U_(0xF) << AFEC_SEQ2R_USCH9_Pos)             /**< (AFEC_SEQ2R) User Sequence Number 9 Mask */
#define AFEC_SEQ2R_USCH9(value)             (AFEC_SEQ2R_USCH9_Msk & ((value) << AFEC_SEQ2R_USCH9_Pos))
#define AFEC_SEQ2R_USCH10_Pos               8                                              /**< (AFEC_SEQ2R) User Sequence Number 10 Position */
#define AFEC_SEQ2R_USCH10_Msk               (_U_(0xF) << AFEC_SEQ2R_USCH10_Pos)            /**< (AFEC_SEQ2R) User Sequence Number 10 Mask */
#define AFEC_SEQ2R_USCH10(value)            (AFEC_SEQ2R_USCH10_Msk & ((value) << AFEC_SEQ2R_USCH10_Pos))
#define AFEC_SEQ2R_USCH11_Pos               12                                             /**< (AFEC_SEQ2R) User Sequence Number 11 Position */
#define AFEC_SEQ2R_USCH11_Msk               (_U_(0xF) << AFEC_SEQ2R_USCH11_Pos)            /**< (AFEC_SEQ2R) User Sequence Number 11 Mask */
#define AFEC_SEQ2R_USCH11(value)            (AFEC_SEQ2R_USCH11_Msk & ((value) << AFEC_SEQ2R_USCH11_Pos))
#define AFEC_SEQ2R_MASK                     _U_(0xFFFF)                                    /**< \deprecated (AFEC_SEQ2R) Register MASK  (Use AFEC_SEQ2R_Msk instead)  */
#define AFEC_SEQ2R_Msk                      _U_(0xFFFF)                                    /**< (AFEC_SEQ2R) Register Mask  */


/* -------- AFEC_CHER : (AFEC Offset: 0x14) (/W 32) AFEC Channel Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Enable                         */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Enable                         */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Enable                         */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Enable                         */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Enable                         */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Enable                         */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Enable                         */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Enable                         */
    uint32_t CH8:1;                     /**< bit:      8  Channel 8 Enable                         */
    uint32_t CH9:1;                     /**< bit:      9  Channel 9 Enable                         */
    uint32_t CH10:1;                    /**< bit:     10  Channel 10 Enable                        */
    uint32_t CH11:1;                    /**< bit:     11  Channel 11 Enable                        */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:12;                     /**< bit:  0..11  Channel xx Enable                        */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CHER_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CHER_OFFSET                    (0x14)                                        /**<  (AFEC_CHER) AFEC Channel Enable Register  Offset */

#define AFEC_CHER_CH0_Pos                   0                                              /**< (AFEC_CHER) Channel 0 Enable Position */
#define AFEC_CHER_CH0_Msk                   (_U_(0x1) << AFEC_CHER_CH0_Pos)                /**< (AFEC_CHER) Channel 0 Enable Mask */
#define AFEC_CHER_CH0                       AFEC_CHER_CH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH0_Msk instead */
#define AFEC_CHER_CH1_Pos                   1                                              /**< (AFEC_CHER) Channel 1 Enable Position */
#define AFEC_CHER_CH1_Msk                   (_U_(0x1) << AFEC_CHER_CH1_Pos)                /**< (AFEC_CHER) Channel 1 Enable Mask */
#define AFEC_CHER_CH1                       AFEC_CHER_CH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH1_Msk instead */
#define AFEC_CHER_CH2_Pos                   2                                              /**< (AFEC_CHER) Channel 2 Enable Position */
#define AFEC_CHER_CH2_Msk                   (_U_(0x1) << AFEC_CHER_CH2_Pos)                /**< (AFEC_CHER) Channel 2 Enable Mask */
#define AFEC_CHER_CH2                       AFEC_CHER_CH2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH2_Msk instead */
#define AFEC_CHER_CH3_Pos                   3                                              /**< (AFEC_CHER) Channel 3 Enable Position */
#define AFEC_CHER_CH3_Msk                   (_U_(0x1) << AFEC_CHER_CH3_Pos)                /**< (AFEC_CHER) Channel 3 Enable Mask */
#define AFEC_CHER_CH3                       AFEC_CHER_CH3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH3_Msk instead */
#define AFEC_CHER_CH4_Pos                   4                                              /**< (AFEC_CHER) Channel 4 Enable Position */
#define AFEC_CHER_CH4_Msk                   (_U_(0x1) << AFEC_CHER_CH4_Pos)                /**< (AFEC_CHER) Channel 4 Enable Mask */
#define AFEC_CHER_CH4                       AFEC_CHER_CH4_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH4_Msk instead */
#define AFEC_CHER_CH5_Pos                   5                                              /**< (AFEC_CHER) Channel 5 Enable Position */
#define AFEC_CHER_CH5_Msk                   (_U_(0x1) << AFEC_CHER_CH5_Pos)                /**< (AFEC_CHER) Channel 5 Enable Mask */
#define AFEC_CHER_CH5                       AFEC_CHER_CH5_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH5_Msk instead */
#define AFEC_CHER_CH6_Pos                   6                                              /**< (AFEC_CHER) Channel 6 Enable Position */
#define AFEC_CHER_CH6_Msk                   (_U_(0x1) << AFEC_CHER_CH6_Pos)                /**< (AFEC_CHER) Channel 6 Enable Mask */
#define AFEC_CHER_CH6                       AFEC_CHER_CH6_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH6_Msk instead */
#define AFEC_CHER_CH7_Pos                   7                                              /**< (AFEC_CHER) Channel 7 Enable Position */
#define AFEC_CHER_CH7_Msk                   (_U_(0x1) << AFEC_CHER_CH7_Pos)                /**< (AFEC_CHER) Channel 7 Enable Mask */
#define AFEC_CHER_CH7                       AFEC_CHER_CH7_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH7_Msk instead */
#define AFEC_CHER_CH8_Pos                   8                                              /**< (AFEC_CHER) Channel 8 Enable Position */
#define AFEC_CHER_CH8_Msk                   (_U_(0x1) << AFEC_CHER_CH8_Pos)                /**< (AFEC_CHER) Channel 8 Enable Mask */
#define AFEC_CHER_CH8                       AFEC_CHER_CH8_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH8_Msk instead */
#define AFEC_CHER_CH9_Pos                   9                                              /**< (AFEC_CHER) Channel 9 Enable Position */
#define AFEC_CHER_CH9_Msk                   (_U_(0x1) << AFEC_CHER_CH9_Pos)                /**< (AFEC_CHER) Channel 9 Enable Mask */
#define AFEC_CHER_CH9                       AFEC_CHER_CH9_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH9_Msk instead */
#define AFEC_CHER_CH10_Pos                  10                                             /**< (AFEC_CHER) Channel 10 Enable Position */
#define AFEC_CHER_CH10_Msk                  (_U_(0x1) << AFEC_CHER_CH10_Pos)               /**< (AFEC_CHER) Channel 10 Enable Mask */
#define AFEC_CHER_CH10                      AFEC_CHER_CH10_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH10_Msk instead */
#define AFEC_CHER_CH11_Pos                  11                                             /**< (AFEC_CHER) Channel 11 Enable Position */
#define AFEC_CHER_CH11_Msk                  (_U_(0x1) << AFEC_CHER_CH11_Pos)               /**< (AFEC_CHER) Channel 11 Enable Mask */
#define AFEC_CHER_CH11                      AFEC_CHER_CH11_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHER_CH11_Msk instead */
#define AFEC_CHER_MASK                      _U_(0xFFF)                                     /**< \deprecated (AFEC_CHER) Register MASK  (Use AFEC_CHER_Msk instead)  */
#define AFEC_CHER_Msk                       _U_(0xFFF)                                     /**< (AFEC_CHER) Register Mask  */

#define AFEC_CHER_CH_Pos                    0                                              /**< (AFEC_CHER Position) Channel xx Enable */
#define AFEC_CHER_CH_Msk                    (_U_(0xFFF) << AFEC_CHER_CH_Pos)               /**< (AFEC_CHER Mask) CH */
#define AFEC_CHER_CH(value)                 (AFEC_CHER_CH_Msk & ((value) << AFEC_CHER_CH_Pos))  

