Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/afec.h
/* -------- AFEC_OVER : (AFEC Offset: 0x4c) (R/ 32) AFEC Overrun Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t OVRE0:1;                   /**< bit:      0  Overrun Error 0                          */
    uint32_t OVRE1:1;                   /**< bit:      1  Overrun Error 1                          */
    uint32_t OVRE2:1;                   /**< bit:      2  Overrun Error 2                          */
    uint32_t OVRE3:1;                   /**< bit:      3  Overrun Error 3                          */
    uint32_t OVRE4:1;                   /**< bit:      4  Overrun Error 4                          */
    uint32_t OVRE5:1;                   /**< bit:      5  Overrun Error 5                          */
    uint32_t OVRE6:1;                   /**< bit:      6  Overrun Error 6                          */
    uint32_t OVRE7:1;                   /**< bit:      7  Overrun Error 7                          */
    uint32_t OVRE8:1;                   /**< bit:      8  Overrun Error 8                          */
    uint32_t OVRE9:1;                   /**< bit:      9  Overrun Error 9                          */
    uint32_t OVRE10:1;                  /**< bit:     10  Overrun Error 10                         */
    uint32_t OVRE11:1;                  /**< bit:     11  Overrun Error 11                         */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t OVRE:12;                   /**< bit:  0..11  Overrun Error xx                         */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_OVER_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_OVER_OFFSET                    (0x4C)                                        /**<  (AFEC_OVER) AFEC Overrun Status Register  Offset */

#define AFEC_OVER_OVRE0_Pos                 0                                              /**< (AFEC_OVER) Overrun Error 0 Position */
#define AFEC_OVER_OVRE0_Msk                 (_U_(0x1) << AFEC_OVER_OVRE0_Pos)              /**< (AFEC_OVER) Overrun Error 0 Mask */
#define AFEC_OVER_OVRE0                     AFEC_OVER_OVRE0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE0_Msk instead */
#define AFEC_OVER_OVRE1_Pos                 1                                              /**< (AFEC_OVER) Overrun Error 1 Position */
#define AFEC_OVER_OVRE1_Msk                 (_U_(0x1) << AFEC_OVER_OVRE1_Pos)              /**< (AFEC_OVER) Overrun Error 1 Mask */
#define AFEC_OVER_OVRE1                     AFEC_OVER_OVRE1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE1_Msk instead */
#define AFEC_OVER_OVRE2_Pos                 2                                              /**< (AFEC_OVER) Overrun Error 2 Position */
#define AFEC_OVER_OVRE2_Msk                 (_U_(0x1) << AFEC_OVER_OVRE2_Pos)              /**< (AFEC_OVER) Overrun Error 2 Mask */
#define AFEC_OVER_OVRE2                     AFEC_OVER_OVRE2_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE2_Msk instead */
#define AFEC_OVER_OVRE3_Pos                 3                                              /**< (AFEC_OVER) Overrun Error 3 Position */
#define AFEC_OVER_OVRE3_Msk                 (_U_(0x1) << AFEC_OVER_OVRE3_Pos)              /**< (AFEC_OVER) Overrun Error 3 Mask */
#define AFEC_OVER_OVRE3                     AFEC_OVER_OVRE3_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE3_Msk instead */
#define AFEC_OVER_OVRE4_Pos                 4                                              /**< (AFEC_OVER) Overrun Error 4 Position */
#define AFEC_OVER_OVRE4_Msk                 (_U_(0x1) << AFEC_OVER_OVRE4_Pos)              /**< (AFEC_OVER) Overrun Error 4 Mask */
#define AFEC_OVER_OVRE4                     AFEC_OVER_OVRE4_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE4_Msk instead */
#define AFEC_OVER_OVRE5_Pos                 5                                              /**< (AFEC_OVER) Overrun Error 5 Position */
#define AFEC_OVER_OVRE5_Msk                 (_U_(0x1) << AFEC_OVER_OVRE5_Pos)              /**< (AFEC_OVER) Overrun Error 5 Mask */
#define AFEC_OVER_OVRE5                     AFEC_OVER_OVRE5_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE5_Msk instead */
#define AFEC_OVER_OVRE6_Pos                 6                                              /**< (AFEC_OVER) Overrun Error 6 Position */
#define AFEC_OVER_OVRE6_Msk                 (_U_(0x1) << AFEC_OVER_OVRE6_Pos)              /**< (AFEC_OVER) Overrun Error 6 Mask */
#define AFEC_OVER_OVRE6                     AFEC_OVER_OVRE6_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE6_Msk instead */
#define AFEC_OVER_OVRE7_Pos                 7                                              /**< (AFEC_OVER) Overrun Error 7 Position */
#define AFEC_OVER_OVRE7_Msk                 (_U_(0x1) << AFEC_OVER_OVRE7_Pos)              /**< (AFEC_OVER) Overrun Error 7 Mask */
#define AFEC_OVER_OVRE7                     AFEC_OVER_OVRE7_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE7_Msk instead */
#define AFEC_OVER_OVRE8_Pos                 8                                              /**< (AFEC_OVER) Overrun Error 8 Position */
#define AFEC_OVER_OVRE8_Msk                 (_U_(0x1) << AFEC_OVER_OVRE8_Pos)              /**< (AFEC_OVER) Overrun Error 8 Mask */
#define AFEC_OVER_OVRE8                     AFEC_OVER_OVRE8_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE8_Msk instead */
#define AFEC_OVER_OVRE9_Pos                 9                                              /**< (AFEC_OVER) Overrun Error 9 Position */
#define AFEC_OVER_OVRE9_Msk                 (_U_(0x1) << AFEC_OVER_OVRE9_Pos)              /**< (AFEC_OVER) Overrun Error 9 Mask */
#define AFEC_OVER_OVRE9                     AFEC_OVER_OVRE9_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE9_Msk instead */
#define AFEC_OVER_OVRE10_Pos                10                                             /**< (AFEC_OVER) Overrun Error 10 Position */
#define AFEC_OVER_OVRE10_Msk                (_U_(0x1) << AFEC_OVER_OVRE10_Pos)             /**< (AFEC_OVER) Overrun Error 10 Mask */
#define AFEC_OVER_OVRE10                    AFEC_OVER_OVRE10_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE10_Msk instead */
#define AFEC_OVER_OVRE11_Pos                11                                             /**< (AFEC_OVER) Overrun Error 11 Position */
#define AFEC_OVER_OVRE11_Msk                (_U_(0x1) << AFEC_OVER_OVRE11_Pos)             /**< (AFEC_OVER) Overrun Error 11 Mask */
#define AFEC_OVER_OVRE11                    AFEC_OVER_OVRE11_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_OVER_OVRE11_Msk instead */
#define AFEC_OVER_MASK                      _U_(0xFFF)                                     /**< \deprecated (AFEC_OVER) Register MASK  (Use AFEC_OVER_Msk instead)  */
#define AFEC_OVER_Msk                       _U_(0xFFF)                                     /**< (AFEC_OVER) Register Mask  */

#define AFEC_OVER_OVRE_Pos                  0                                              /**< (AFEC_OVER Position) Overrun Error xx */
#define AFEC_OVER_OVRE_Msk                  (_U_(0xFFF) << AFEC_OVER_OVRE_Pos)             /**< (AFEC_OVER Mask) OVRE */
#define AFEC_OVER_OVRE(value)               (AFEC_OVER_OVRE_Msk & ((value) << AFEC_OVER_OVRE_Pos))  

